In [1]:
import pandas as pd
import numpy as np

#Creando DATAFRAME desde un ARCHIVO csV

df_exams = pd.read_csv("StudentsPerformance.csv")
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [3]:
#Operaciones con Columnas

df_exams['math score'].sum() # Sumando valores de la columna

66089

In [4]:
#Operaciones con Columnas

df_exams['math score'].count() # Contando # valores de la columna

1000

In [5]:
#Operaciones con Columnas

df_exams['math score'].max() # Valor Maximo

100

In [6]:
#Operaciones con Columnas

df_exams['math score'].min() # Valor Minimo

0

In [8]:
#Usando Describe

df_exams.describe() ## Aplica sobre columnas con valor numerico

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [10]:
#OPERACIONES CON FILAS

#Sumando Valores de una fila

df_exams['math score']+df_exams['reading score']+df_exams['writing score']

0      218
1      247
2      278
3      148
4      229
      ...
995    282
996    172
997    195
998    223
999    249
Length: 1000, dtype: int64

In [46]:
1 << 4  ## tips a << b calculo de a * 2 a la pontencia b .. Tratamento binario mas rapido

16

In [48]:
#OPERACIONES CON FILAS

df_exams['average']=round((df_exams['math score']+df_exams['reading score']+df_exams['writing score'])/3,2)

df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,average
0,female,group B,bachelor's degree,standard,none,72,72,74,72.67
1,female,group C,some college,standard,completed,69,90,88,82.33
2,female,group B,master's degree,standard,none,90,95,93,92.67
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.33
4,male,group C,some college,standard,none,76,78,75,76.33
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,94.00
996,male,group C,high school,free/reduced,none,62,55,55,57.33
997,female,group C,high school,free/reduced,completed,59,71,65,65.00
998,female,group D,some college,standard,completed,68,78,77,74.33
999,female,group D,some college,free/reduced,none,77,86,86,83.00

In [50]:
#Value Counts

#Funcion len
len(df_exams['gender'])

#Metodo count()
df_exams['gender'].count()

1000

In [53]:
#Contar Diferentes elementos de una columna 

df_exams['gender'].value_counts() #cuenta elementos de 'gender' x categoria

female    518
male      482
Name: gender, dtype: int64

In [54]:
#obtener la frecuencia relativa (Dividir todos los valores entre la suma total)


df_exams['gender'].value_counts(normalize=True)

female    0.518
male      0.482
Name: gender, dtype: float64

In [56]:
df_exams['parental level of education'].value_counts() #cuenta elementos de 'parental level of education' x categoria

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [58]:
df_exams['parental level of education'].value_counts(normalize=True).round(2) # Obteniendo la frecuencia relativa con dos decimales

some college          0.23
associate's degree    0.22
high school           0.20
some high school      0.18
bachelor's degree     0.12
master's degree       0.06
Name: parental level of education, dtype: float64